In [3]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame
from numpy import nan as NA

In [51]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [52]:
obj = Series(sdata)

In [53]:
obj

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [57]:
obj['Oregon']

16000

In [58]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [59]:
obj1 = Series(sdata, index = states)

In [60]:
obj1

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [61]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [64]:
frame = DataFrame(data)

In [65]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [68]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop'], index = ['one','two','three','four','five'])

In [69]:
frame2

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9

In [71]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [76]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
Name: three, dtype: object

In [83]:
frame2['dept'] = np.arange(5)

In [84]:
frame2

       year   state  pop  dept
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [88]:
frame2['eastern'] = frame2['state'] == 'Ohio'

In [89]:
frame2

       year   state  pop  dept  eastern
one    2000    Ohio  1.5     0     True
two    2001    Ohio  1.7     1     True
three  2002    Ohio  3.6     2     True
four   2001  Nevada  2.4     3    False
five   2002  Nevada  2.9     4    False

In [90]:
del frame2['eastern']

In [91]:
frame2

       year   state  pop  dept
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [92]:
frame2.columns

Index(['year', 'state', 'pop', 'dept'], dtype='object')

In [94]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [122]:
frame3 = DataFrame(pop)

In [123]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [124]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [125]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [126]:
frame3.index.name = 'year';frame3.columns.name = 'states'

In [127]:
frame3

states  Nevada  Ohio
year
2000       NaN   1.5
2001       2.4   1.7
2002       2.9   3.6

In [101]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [102]:
frame2.values

array([[2000, 'Ohio', 1.5, 0],
       [2001, 'Ohio', 1.7, 1],
       [2002, 'Ohio', 3.6, 2],
       [2001, 'Nevada', 2.4, 3],
       [2002, 'Nevada', 2.9, 4]], dtype=object)

In [103]:
frame.values

array([['Ohio', 2000, 1.5],
       ['Ohio', 2001, 1.7],
       ['Ohio', 2002, 3.6],
       ['Nevada', 2001, 2.4],
       ['Nevada', 2002, 2.9]], dtype=object)

In [128]:
frame3

states  Nevada  Ohio
year
2000       NaN   1.5
2001       2.4   1.7
2002       2.9   3.6

In [129]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [131]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [148]:
frame5 = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])

In [149]:
frame5

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [155]:
states = ['Texas', 'Utah', 'California']

In [159]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [160]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [161]:
new_obj = obj.drop('c')

In [162]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [163]:
obj.drop(['b','c'])

a    0.0
d    3.0
e    4.0
dtype: float64

In [164]:
data = DataFrame(np.arange(16).reshape((4, 4)),
 index=['Ohio', 'Colorado', 'Utah', 'New York'],
 columns=['one', 'two', 'three', 'four'])

In [165]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [170]:
data.drop(['one', 'four'], axis = 1)

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

# Indexing, selection, and filtering

In [171]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [172]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [175]:
obj[['b','d']]

b    1.0
d    3.0
dtype: float64

In [179]:
obj['a':'c'] = 5

In [180]:
obj

a    5.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [181]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],columns=['d', 'a', 'b', 'c'])

In [182]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [188]:
frame.sort_index(axis = 1, ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [189]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [190]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [192]:
frame.sort_values(by = 'b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

## Summarizing and Computing Descriptive Statistics

In [193]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
 [np.nan, np.nan], [0.75, -1.3]],
index=['a', 'b', 'c', 'd'],
 columns=['one', 'two'])

In [194]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [195]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [196]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [197]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [199]:
df.mean(axis = 1, skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [200]:
df.idxmax() #returns id of the maximum values

one    b
two    d
dtype: object

In [202]:
df.idxmin() #returns id of the minimum values

one    d
two    b
dtype: object

In [203]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [205]:
df.describe() #describes a statistical summary

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [213]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [214]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [216]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [217]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
 'Qu2': [2, 3, 1, 2, 3],
'Qu3': [1, 5, 2, 4, 4]})

In [218]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [219]:
result = data.apply(pd.value_counts).fillna(0)

In [220]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

# Handling Missing Data

In [221]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [222]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [224]:
string_data[0] = None

## Filtering Out Missing Data

In [228]:
data = Series([1, NA, 3.5, NA, 7])

In [229]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [230]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [231]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
 [NA, NA, NA], [NA, 6.5, 3.]])

In [232]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [233]:
data.dropna()  # in dataframe, dropna() drops any row with NA

     0    1    2
0  1.0  6.5  3.0

In [234]:
data.dropna(how = 'all') #drops only rows that all its values missing

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [235]:
data[4] = NA

In [236]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [237]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

## Filling in Missing Data

In [238]:
df = DataFrame(np.random.randn(7, 3))

In [239]:
df

          0         1         2
0 -0.731102  0.324853  1.258336
1  0.088857  0.201563  0.085643
2 -0.909601 -0.104443  0.006217
3 -0.559222  0.160160 -1.136604
4 -0.067452 -0.374277 -1.006764
5 -1.094149  0.885468  1.648987
6 -0.259424  1.444164 -0.494094

In [240]:
df.iloc[:4, 1] = NA; df.iloc[:2, 2] = NA

In [241]:
df

          0         1         2
0 -0.731102       NaN       NaN
1  0.088857       NaN       NaN
2 -0.909601       NaN  0.006217
3 -0.559222       NaN -1.136604
4 -0.067452 -0.374277 -1.006764
5 -1.094149  0.885468  1.648987
6 -0.259424  1.444164 -0.494094

In [242]:
df.fillna(0)

          0         1         2
0 -0.731102  0.000000  0.000000
1  0.088857  0.000000  0.000000
2 -0.909601  0.000000  0.006217
3 -0.559222  0.000000 -1.136604
4 -0.067452 -0.374277 -1.006764
5 -1.094149  0.885468  1.648987
6 -0.259424  1.444164 -0.494094

In [245]:
df_filled = df.fillna({1:0.5, 2:1.0})

In [246]:
df_filled

          0         1         2
0 -0.731102  0.500000  1.000000
1  0.088857  0.500000  1.000000
2 -0.909601  0.500000  0.006217
3 -0.559222  0.500000 -1.136604
4 -0.067452 -0.374277 -1.006764
5 -1.094149  0.885468  1.648987
6 -0.259424  1.444164 -0.494094

In [247]:
df.fillna(0, inplace = True)

In [248]:
df

          0         1         2
0 -0.731102  0.000000  0.000000
1  0.088857  0.000000  0.000000
2 -0.909601  0.000000  0.006217
3 -0.559222  0.000000 -1.136604
4 -0.067452 -0.374277 -1.006764
5 -1.094149  0.885468  1.648987
6 -0.259424  1.444164 -0.494094

In [3]:
df = DataFrame(np.random.randn(6, 3))

In [4]:
df

          0         1         2
0  1.007629 -1.095571  0.721361
1  0.634193 -2.605542  1.245394
2 -0.780927 -0.831223  0.466781
3  0.989631  0.383794 -1.618999
4 -0.552994 -0.210415  2.579713
5  1.224789 -0.556966 -0.407808

In [7]:
df.iloc[2:, 1] = NA; df.iloc[4:, 2] = NA

In [8]:
df

          0         1         2
0  1.007629 -1.095571  0.721361
1  0.634193 -2.605542  1.245394
2 -0.780927       NaN  0.466781
3  0.989631       NaN -1.618999
4 -0.552994       NaN       NaN
5  1.224789       NaN       NaN

In [9]:
df.fillna(method='ffill')

          0         1         2
0  1.007629 -1.095571  0.721361
1  0.634193 -2.605542  1.245394
2 -0.780927 -2.605542  0.466781
3  0.989631 -2.605542 -1.618999
4 -0.552994 -2.605542 -1.618999
5  1.224789 -2.605542 -1.618999

In [10]:
data = Series([1., NA, 3.5, NA, 7])

In [12]:
data.mean()

3.8333333333333335

In [13]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [14]:
df

          0         1         2
0  1.007629 -1.095571  0.721361
1  0.634193 -2.605542  1.245394
2 -0.780927       NaN  0.466781
3  0.989631       NaN -1.618999
4 -0.552994       NaN       NaN
5  1.224789       NaN       NaN

In [22]:
df.fillna({1:df[1].mean(), 2:df[2].mean()})

          0         1         2
0  1.007629 -1.095571  0.721361
1  0.634193 -2.605542  1.245394
2 -0.780927 -1.850557  0.466781
3  0.989631 -1.850557 -1.618999
4 -0.552994 -1.850557  0.203634
5  1.224789 -1.850557  0.203634

In [23]:
df

          0         1         2
0  1.007629 -1.095571  0.721361
1  0.634193 -2.605542  1.245394
2 -0.780927       NaN  0.466781
3  0.989631       NaN -1.618999
4 -0.552994       NaN       NaN
5  1.224789       NaN       NaN

In [31]:
dict = {}                            #to fill n amount of column with NA with the average of the column data
for col in df.columns:
    dict[col] = df[col].mean()
print (dict)

{0: 0.4203868467196137, 1: -1.8505565007088136, 2: 0.20363427453741717}

In [32]:
df.fillna(dict)

          0         1         2
0  1.007629 -1.095571  0.721361
1  0.634193 -2.605542  1.245394
2 -0.780927 -1.850557  0.466781
3  0.989631 -1.850557 -1.618999
4 -0.552994 -1.850557  0.203634
5  1.224789 -1.850557  0.203634

## Hierarchical Indexing

In [33]:
data = Series(np.random.randn(10),
 index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
 [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [54]:
data

a  1    1.835162
   2    0.015356
   3   -0.159698
b  1   -0.349610
   2   -0.418006
   3    0.404957
c  1   -2.244544
   2   -1.621531
d  2   -1.808357
   3   -1.348783
dtype: float64

In [37]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [55]:
data['a']

1    1.835162
2    0.015356
3   -0.159698
dtype: float64

In [38]:
data.unstack()

          1         2         3
a  1.835162  0.015356 -0.159698
b -0.349610 -0.418006  0.404957
c -2.244544 -1.621531       NaN
d       NaN -1.808357 -1.348783

In [50]:
frame = DataFrame(np.arange(12).reshape((4, 3)),   #multilevel indexing in rows and columns
 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
 columns=[['Ohio', 'Ohio', 'Colorado'],
 ['Green', 'Red', 'Green']])

In [51]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [59]:
frame.columns.names = ['State','color']
frame.index.names = ['key1','key2']

In [60]:
frame

State      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [62]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [61]:
frame.sum(level = 'key1')

State  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [63]:
frame.swaplevel('key1','key2')

State      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [64]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
 'd': [0, 1, 2, 0, 1, 2, 3]})

In [65]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [66]:
frame2 = frame.set_index(['c', 'd'])

In [67]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [4]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
 'data1': range(7)})
df2 = DataFrame({'key': ['a', 'b', 'd'],
 'data2': range(3)})

In [5]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [6]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [8]:
pd.merge(df1,df2, on = 'key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [9]:
df3 = DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
'data1': range(7)})
df4 = DataFrame({'rkey': ['a', 'b', 'd'],
 'data2': range(3)})

In [10]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [11]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [13]:
pd.merge(df3,df4,left_on = 'lkey', right_on = 'rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [15]:
pd.merge(df3,df4,left_on = 'lkey', right_on = 'rkey',how = 'outer')

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

In [16]:
pd.merge(df1,df2, on = 'key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [20]:
pd.merge(df1,df2, on = 'key', how = 'inner')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0